"use strict";

const accounts1000 = [
  [1100, "Денежные средства к кассе"],
  [1110, "Денежные средства в национальной валюте"],
  [1200, "Денежные средства в иностранной валюте  "],
  [1210, "Денежные средства в банке"],
  [1220, "Счета в иностранной валюте в местных банках"],
  [1410, "Счета к получению за товары, услуги"],
  [1500, "Дебиторская задолженность по прочим операциям"],
  [1520, "Дебиторская задолженность сотрудников и директоров"],
  [1530, "Налоги, оплаченные авансом"],
  [1590, "Прочая дебиторская задолженность"],
  [1600, "Товарно-материальные запасы"],
  [1620, "Запасы сырья и основн. материалов"],
  [1750, "Малоценные и быстроизнашивающиеся предметы"],
  [1800, "Авансы выданные"],
  [1810, "Запасы, оплаченные авансом"],
  [1820, "Услуги, оплаченные авансом"],
  [1830, "Аренда, оплаченная авансом"],
];

const accounts3000 = [
  [3100, "Счета к оплате"],
  [3110, "Счета к оплате за товары и услуги"],
  [3400, "Налоги к оплате"],
  [3420, "Подоходный налог на доходы физических лиц"],
  [3490, "Прочие налоги к оплате/3480 НсП"],
  [3520, "Начисленная заработная плата"],
  [3530, "Начисленные взносы на социальное страхование"],
  [3531, "Начисленные страховые взносы (10,25%)"],
  [3534, "ГНПФ (2%)"],
  [3600, "Прочие краткосрочные обязательства"],
];

const accounts5000 = [
  [5300, "Нераспределенная прибыль"],
];

const accounts8000 = [
  [8000, "Общие и административные расходы"],
  [8010, "Расходы по оплате труда"],
  [8020, "Расходы по отчислениям в социальный фонд"],
  [8030, "Расходы по оплате аренды"],
  [8040, "Расходы по оплате услуг"],
  [8050, "Налог на имущество"],
  [8060, "Расходы на канцелярские принадлежности"],
  [8070, "Расходы на коммуникации"],
  [8110, "Ремонт и техническое обслуживание основных средств"],
  [8190, "Расходы по прочим налогам"],
  [8220, "Расходы по коммунальным услугам"],
  [8490, "Прочие общие и административные расходы"],
];

const accounts = [
  ...accounts1000,
  ...accounts3000,
  ...accounts5000,
  ...accounts8000,
];

const insert_script = `VALUES\n${accounts.map(a => `\t(${a[0]}, '${a[1]}')`).join(",\n")}`;
const delete_script = `delete from account where code in (${accounts.flatMap(a => a[0])})`
console.log(delete_script);
